const vacanciesData = [
    {
      id: 1,
      title: "Должность",
      requirements:
        "Текст про требования текст про требования текст про требования текст про требования текст про требования",
      responsibilities:
        "Текст про обязанности текст про обязанности текст про обязанности текст про обязанности текст про обязанности",
      conditions:
        "Текст про условия текст про условия текст про условия текст про условия текст про условия текст про условия",
      phone: "+7 904 271 35 90",
    },
    {
      id: 2,
      title: "Должность",
      requirements: "Текст про требования...",
      responsibilities: "Текст про обязанности...",
      conditions: "Текст про условия...",
      phone: "+7 904 271 35 90",
    },
    {
      id: 3,
      title: "Должность",
      requirements: "Текст про требования...",
      responsibilities: "Текст про обязанности...",
      conditions: "Текст про условия...",
      phone: "+7 904 271 35 90",
    },
    {
      id: 4,
      title: "Должность",
      requirements: "Текст про требования...",
      responsibilities: "Текст про обязанности...",
      conditions: "Текст про условия...",
      phone: "+7 904 271 35 90",
    },
    {
      id: 5,
      title: "Должность",
      requirements: "Текст про требования...",
      responsibilities: "Текст про обязанности...",
      conditions: "Текст про условия...",
      phone: "+7 904 271 35 90",
    },
    {
      id: 6,
      title: "Должность",
      requirements: "Текст про требования...",
      responsibilities: "Текст про обязанности...",
      conditions: "Текст про условия...",
      phone: "+7 904 271 35 90",
    },
  ];
  
  export default vacanciesData;
  