export const accordionData = [
    {
      title: 'Кто написал сказку «Кот в сапогах»?',
      content: `Шарль Перро`
    },
    {
      title: 'Что крикнул кот королю, когда он подъехал к замку?',
      content: `Добро пожаловать в замок маркиза де Карабаса!`
    },
    {
      title: 'Как поступил кот с великаном, когда тот превратился в мышку?',
      content: `Разом проглотил`
    },
    {
      title: 'О чём кот попросил крестьян, косивших сено на лугу?',
      content: `Чтобы те сказали маркизу, что луг принадлежит ему`
    },
    {title: 'Чему якобы не мог поверить кот великану?',
    content: `Что он может превращаться даже в самых мелких зверей`
  }
  ];
  